app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
  def show
    if User.another_user?(current_user,params[:id])
      redirect_to profile_user_path(params[:id])
      return
    else
      @owner = "我"
    end
    @user = User.find(params[:id])